export/issues/1.tex
% Created 2024-07-05 Fri 13:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Gleefre}
\date{\today}
\title{PLN CDR draft: Issue 1}
\hypersetup{
 pdfauthor={Gleefre},
 pdftitle={PLN CDR draft: Issue 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Issue 1 ([ADD-/REMOVE-]PACKAGE-LOCAL-NICKNAME return values)}
\label{sec:org93e2b52}
\subsection{Description}
\label{sec:orgfaf5731}
Return values of \texttt{add-package-local-nickname} and \texttt{remove-package-local-nickname}
are inconsistent. The first one always returns \emph{designated package}, while the
second one returns \emph{true} (generalized boolean) if a nickname was removed.

Moreover, there is no consensus among current implementations as to what the second
function (\texttt{remove-package-local-nickname}) should return.
\subsection{Examples}
\label{sec:org02b218f}
\begin{verbatim}
(defpackage #:foo (:use))
(defpackage #:bar (:use))

(add-package-local-nickname '#:nick '#:bar '#:foo)
; => #<PACKAGE "FOO">  (sbcl, ccl, ecl, acl, abcl, clasp, lispworks)
(add-package-local-nickname '#:nick '#:bar '#:foo)
; => #<PACKAGE "FOO">  (sbcl, ccl, ecl, acl, abcl, clasp, lispworks)
(remove-package-local-nickname '#:nick '#:foo)
; => T  (sbcl, ccl, ecl, acl, clasp)
; => #<PACKAGE "BAR">  (abcl)
; => NIL  (lispworks)
(remove-package-local-nickname '#:nick '#:foo)
; => NIL  (sbcl, ccl, ecl, acl, abcl, clasp, lispworks)
\end{verbatim}
\subsection{Current behavior}
\label{sec:org57f017e}
sbcl, ccl, ecl, acl, abcl, clasp, lispworks:
  \texttt{add-package-local-nickname} always returns \emph{designated package}.

sbcl, ccl, ecl, acl, clasp:
  \texttt{remove-package-local-nickname} returns \texttt{T} if a nickname was removed,
  and \texttt{NIL} otherwise.

abcl:
  \texttt{remove-package-local-nickname} if a nickname was removed, returns \emph{true} (more
  specifically - the package that was nicknamed by that nickname), and \texttt{NIL}
  otherwise.

lispworks:
  \texttt{remove-package-local-nickname} always returns \texttt{NIL}.
\subsection{Proposal DESIGNATED-PACKAGE-IF-SUCCESSFUL}
\label{sec:org02f8971}
\begin{itemize}
\item \texttt{add-package-local-nickname} should return \emph{designated package} if a new nickname
was added and \texttt{NIL} otherwise, if the nickname already existed.
\item \texttt{remove-package-local-nickname} should return \emph{designated package} if a nickname
was removed and \texttt{NIL} otherwise.
\end{itemize}
\subsection{Proposal ALWAYS-T}
\label{sec:orgbb649c0}
Similar to \texttt{use-package} and \texttt{unuse-package}:
\begin{itemize}
\item \texttt{add-package-local-nickname} should always return \texttt{T}.
\item \texttt{remove-package-local-nickname} should always return \texttt{T}.
\end{itemize}
\subsection{Proposal ELIMINATE-GENERALIZED\textsubscript{BOOLEAN}}
\label{sec:org917c0df}
\begin{itemize}
\item \texttt{add-package-local-nickname} should alwyas return \emph{designated package}.
\item \texttt{remove-package-local-nickname} should return \texttt{T} if a nickname was removed and
\texttt{NIL} otherwise.
\end{itemize}
\end{document}